import React from 'react';
import { NavLink } from "react-router-dom"
import flower from "../images/flower-border.png"

const Temple = ({
    name,
    imgsrc,
    isCompName,
    compName,
    visit,
    btnname
}) => {
    return (
        <>
            <section id="header" className="d-block d-flex align-items-center">
                <div className="container-fluid">
                    <div className="row">
                        <div className="col-11 mx-auto">
                            <div className="row g-0 pt-5 mt-5">_</div>
                            <div className="row g-0 pt-5 mt-5">_</div>
                            <div className="row g-0 pt-5 mt-5">
                                <div className="col-lg-6 col-md-12 pt-5 pt-lg-0 order-2 order-lg-1 d-flex justify-content-center flex-column">
                                    <p className="blockquote bg-light fs-6 text-center fw-bold">
                                        {name}</p><p className="fs-2 fw-bold">
                                        {isCompName ? <strong className="brand-name"> {compName}</strong> : ""}

                                    </p>
                                    <br />
                                    <p className=""><small>
                                        <strong>ಶ್ರೀ ಕ್ಷೇತ್ರ ಗಿಡದ ಕಂಚನಹಳ್ಳಿ
                                        ಶ್ರೀ ಪಟ್ಟಲದಮ್ಮ ಕೊಲ್ಲಾಪುರದಮ್ಮ ದೇವಾಲಯ</strong> 
                                        ತುಮಕೂರು ಜಿಲ್ಲೆ ಕುಣಿಗಲ್ ತಾಲ್ಲೂಕು ಹುಲಿಯೂರುದುರ್ಗ ಹೋಬಳಿ ಗಿಡದಂಚನಹಳ್ಳಿ
                                        ಶ್ರೀ ಮಹಾಕಾಳಿ ಶ್ರೀ ಮಹಾಲಕ್ಷ್ಮಿ ಶ್ರೀ ಮಹಾಸರಸ್ವತಿ ಸ್ವರೂಪಿಯಾದಂತ ಶ್ರೀ ಕೊಲ್ಲಾಪುರದಮ್ಮ ಜಗದ್ವಿಖ್ಯಾತ ಆಗಿದ್ದಾಳೆ. ಶ್ರೀ ಕ್ಷೇತ್ರ ಗಿಡದ
                                        ಕೆಂಚನಹಳ್ಳಿಯಲ್ಲಿ ಅಮ್ಮನವರ ಪವಾಡಗಳು ಹೇಳಲಸಾಧ್ಯ ಮತ್ತು ಮಹಾ ವಿಶೇಷವಾದದ್ದು
                                        ಯಾವುದೇ ಒಂದು ಕೆಲಸ ಕಾರ್ಯ ಮಾಡಬೇಕಾದರೆ ಒಂದು ಸಮರ್ಪಣೆ ಮನೋಭಾವ ಬೇಕು. ಚಂಡಿಕಾಪರಮೇಶ್ವರಿ ಇಲ್ಲಿ ಪಟ್ಟಲದಮ್ಮ
                                        ಆಗಿರುವಂತೆ ದೇವಿ ಅನುಗ್ರಹ ಮಾಡಬೇಕಾದರೆ ಭಕ್ತಾದಿಗಳನ್ನು ಸೇರಿಸುವಂತೆ ಮಾಡಿ ಆ ದೇವಿ ಅನುಗ್ರಹವನ್ನು ಅವರಿಗೆ ತಲುಪಿಸುವಂತಹ
                                        ಒಬ್ಬ ಮಾರ್ಗದರ್ಶಕರಾಗಿ ಶ್ರೀಯುತ ಶಂಕರ್ ಅವರು ಇಲ್ಲಿ ಬಹಳ ಸೇವೆ ಮಾಡಿದ್ದಾರೆ.
                                        ಶ್ರೀಯುತ ಶಂಕರ್ ಅವರಿಗೆ ಅನುಗ್ರಹವಾದ ಮೇಲೆ ತಮ್ಮ ಪರಿಪೂರ್ಣ ಜೀವನವನ್ನು ಲೌಕಿಕ ಜೀವನವನ್ನು ತ್ಯಾಗ ಮಾಡಿ ಚಿಕ್ಕದಾದ ಒಂದು
                                        ಹುತ್ತದಲ್ಲಿ ಆವಿರ್ಭೂತವಾಗಿ ಉದ್ಭವಿಸಿದ ದೇವಿಯನ್ನು ಆರಂಭದಲ್ಲಿ ಚಿಕ್ಕದಾಗಿ ದೇವಿಯ ಸೇವೆಯನ್ನು ನಡೆಸುತ್ತಾ ಬಂದರು.
                                        ಅನಂತರ ಈಗ ದೊಡ್ಡದಾಗಿ ಬೆಳೆದಂತೆ ಕ್ಷೇತ್ರಕ್ಕೆ ಅಪಾರವಾದ ಕೊಡುಗೆ ನೀಡಿದ್ದಾರೆ. ಎಂತಹದೇ ಕಷ್ಟಕಾರ್ಪಣ್ಯಗಳು ಬಂದರು ದೇವಿಯ ಬಳಿ
                                        ಬಂದು ಶರಣಾಗತರಾದರೆ ಕಷ್ಟಕಾರ್ಪಣ್ಯಗಳು ದೂರವಾಗುತ್ತದೆ. ಅಂಥ ದಿವ್ಯಕ್ಷೇತ್ರ ಇದು.
                                        ಒಳ್ಳೆಯ ಪರಿಸರದಲ್ಲಿ ತಾಯಿ ನೆಲೆನಿಂತಿದ್ದಾಳೆ ಪ್ರತಿ ಅಮಾವಾಸ್ಯೆ ಹುಣ್ಣಿಮೆಯೆಂದು ಅಮ್ಮನವರಿಗೆ ಬಹಳ ವಿಶೇಷ ಪೂಜೆಯನ್ನು
                                        ಮಾಡುತ್ತಾರೆ. ಕೊಲ್ಲಾಪುರದಮ್ಮ ಪಟ್ಟದಲಮ್ಮ ಸುಬ್ರಮಣ್ಯಶ್ವರರು ಇರುವ ಈ ಮಹಾ ಕ್ಷೇತ್ರದಲ್ಲಿ ಸಾವಿರಾರು ಜನಕ್ಕೆ ಅನ್ನದಾಸೋಹ
                                        ನಡೆಯುತ್ತದೆ. ಗೋಶಾಲೆಯು ಇದೆ. ಇಲ್ಲಿ ಜಾತಿ ಭೇದವಿಲ್ಲದೆ ಬಂದ ಎಲ್ಲಾ ಭಕ್ತಾದಿಗಳಿಗೂ ಅನ್ನದಾನ ನಡೆಯುತ್ತದೆ.
                                        ಹಾಗೇ ಈ ಕ್ಷೇತ್ರದಲ್ಲಿ ಕೊಂಡೊತ್ಸವ, ಜಾತ್ರಾ ಮಹೋತ್ಸವ ಸಮಾರಂಭಗಳನ್ನು ಬಹಳ ವಿಜೃಂಭಣೆಯಿಂದ ಆಚರಿಸಲಾಗುತ್ತದೆ.
                                        ಮತ್ತೆ ಈ ಕ್ಷೇತ್ರದಲ್ಲಿ ವಿಶೇಷವಾದ ಮತ್ತು ವಿಶಾಲವಾದ ಕಲ್ಯಾಣ ಮಂಟಪವಿದ್ದು, ಶುಭಕಾರ್ಯಗಳನ್ನು ಮಾಡಲು ಬರುವವರಿಗೆ ಅತಿ ಕಡಿಮೆ
                                        ವೆಚ್ಚದಲ್ಲಿ ಎಲ್ಲ ಸೌಕರ್ಯಗಳು ಕೂಡ ಇಲ್ಲಿವೆ. ಈ ಕಲ್ಯಾಣ ಮಂಟಪದ ಪಕ್ಕದಲ್ಲೇ ಒಂದು ಕಲ್ಯಾಣಿ ಇದೆ.
                                        ಈ ಕ್ಷೇತ್ರದಲ್ಲಿ ಶ್ರೀ ಶಿವನನ್ನು ಕೂಡ ನಾವು ದರ್ಶನ ಮಾಡಬಹುದು ಭಕ್ತರು ಯಾವ ಸಮಯದಲ್ಲಿ ಬಂದರೂ ಕೂಡ ಅನ್ನ ದಾಸೋಹದ
                                        ವ್ಯವಸ್ಥೆ ಇರುತ್ತದೆ.
                                        ಹಾಗೆಯೇ ಈ ಕ್ಷೇತ್ರದ ಮತ್ತೂಂದು ವಿಶೇಷತೆ ಏನೆಂದರೆ ಈ ಕ್ಷೇತ್ರದಲ್ಲಿ ನಡೆದಾಡುವ ದೇವರು ಎಂದೇ ಹೆಸರುವಾಸಿಯಾಗಿರುವ
                                        ಬಸವಣ್ಣನವರು ನೆಲೆಸಿರುವ ಪುಣ್ಯ ಕ್ಷೇತ್ರವೂ ಹೌದು. ತಾಯಂದಿರ ಆಶೀರ್ವಾದದಿಂದ ನೆಲೆಸಿರುವ ಈ ಬಸವಣ್ಣನಿಗೆ ವಿಶೇಷವಾದ ಶಕ್ತಿ ಇದೆ.
                                        ಬರುವಂತ ಭಕ್ತಾದಿಗಳ ಕಷ್ಟಗಳನ್ನು ದೂರ ಮಾಡಲು ತನ್ನ ಪವಿಶ್ರವಾದ ಪಾದಗಳನ್ನು ನೀಡುವುದರ ಮುಖಾಂತರ ಮತ್ತು ಭಕ್ತಾದಿಗಳನ್ನು
                                        ದಾಟುವುದರ ಮುಖಾಂತರ ಎಲ್ಲಾ ಕಷ್ಟಗಳನ್ನು ದೂರ ಮಾಡುತ್ತಿದ್ದಾನೆ ಈ ಭಗವಂತ.
                                        ತಪ್ಪದೇ ಎಲ್ಲರೂ ಕೂಡ ಈ ಪುಣ್ಯ ಕ್ಷೇತ್ರವನ್ನು ಭೇಟಿ ಮಾಡಿ ಇಲ್ಲಿ ನೆಲೆಸಿರುವ ದೇವಾನುದೇವತೆಗಳ ದರ್ಶನದಿಂದ ಪುನೀತರಾಗಿ</small>
                                    </p>
                                    <div className="mb-3">
                                        <NavLink to={visit} className="btn-get-started ">
                                            {btnname}
                                        </NavLink>
                                    </div>
                                </div>
                                <div className="col-sm-12 col-md-6 col-lg-6 order-1 order-lg-2  order-md-1 ">
                                    <img src={imgsrc} className="imgmain img-fluid animated " alt="Home Img" />
                                </div>
                            </div>
                            <div className="container-fluid d-flex justify-content-center">
                                <img src={flower} alt="Home Img" className="flowerfilter" />
                            </div>
                        </div>
                        <div className="row g-0 pt-2 mt-4   ">_</div>
                    </div>
                </div>
            </section>
        </>
    )
}

export default Temple;
